[
    {
    
        "name":"Saurabh Garg",
        "image":"https://images.geekster.in/new-testimonial/Saurabh-Garg.webp",
        "company":"https://images.geekster.in/hiring-partners/avizva.webp",
        "description":"I have had a great learning experience with Geekster. They not just focus on technical skills but prepare us for interviews through soft-skills training as well. The detailed courses, coding assigments, demo projects, and mock interviews help us get a good job opportunity."


    },
    {
    
        "name":"Kaushal-Sorathiya",
        "image":"https://images.geekster.in/new-testimonial/Kaushal-Sorathiya.webp",
        "company":"https://images.geekster.in/hiring-partners/quinta.webp",
        "description":"Being a newbie in the coding world i was underconfident about my skills earlier but with Geekster one to one mentoring and guidance, I am currently working as a full stack java developer within a period of 3 months only"
    },
    {
    
        "name":"Sai Pranav Tunuguntla",
        "image":"https://images.geekster.in/new-testimonial/Sai-Pranav-Tunuguntla.webp",
        "company":"https://images.geekster.in/hiring-partners/smart-docs.webp",
        "description":"I got all the help and mentorship I needed to ace my full stack interviews. Before joining Geekster I did not know how to go about navigating the job world as a fresher. With Geekster I could get a job with a product company."

    },
    {
    
        "name":"Gajendra Malviya",
        "image":"https://images.geekster.in/new-testimonial/Gajendra-Malviya.webp",
        "company":"https://images.geekster.in/hiring-partners/riskcovry.webp",
        "description":"From '0 offers' to 'multiple offers, that has been my journey at Geekster. My happiness multiplies when I see my proud family. It is the learnings and guidance I received during the course that had brought me success."
    },
    {
    
        "name":"Karri Devi",
        "image":"https://images.geekster.in/new-testimonial/Karri-Devi.webp" ,
        "company":"https://images.geekster.in/hiring-partners/publicis-sapient.webp",
        "description":"I did not know enough about coding before joining Geekster and had no job. All my friends had jobs by then. I joined Geekster and learned everything about full stack development. With the help of Geekster team I was able to join Publicis Sapient as a developer"
    },
    {
    
        "name":"Naveen Katiyar",
        "image":"https://images.geekster.in/new-testimonial/Naveen-Katiyar.webp",
        "company":"https://images.geekster.in/hiring-partners/rakuten.webp",
        "description":"Geekster is an excellent platform for learning new software development technologies to crack interviews at reputed companies. Mentors solve doubts in every possible way"
    },
    {
    
        "name":"Nipun Sinha",
        "image":"https://images.geekster.in/new-testimonial/Nipun-Sinha.webp",
        "company":"https://images.geekster.in/hiring-partners/societe-generale.webp",
        "description":"I worked on my basic to advanced technical skills under Geekster's expert mentors. I realised that other group students also had zero technical knowledge, but as the course progressed, everyone was comfortable. Mock interviews, live sessions, and soft skills improved me a lot."
    },
    {
    
        "name":"Utkarsh Singh",
        "image":"https://images.geekster.in/new-testimonial/Utkarsh-singh.webp", 
        "company":"https://images.geekster.in/hiring-partners/Bluewud.webp",
        "description":"Geekster taught me in months what years of college work couldn't teach me. They honed my technical and non-technical skills, build my confidence and gave me a flavor of what it would look like working in the industry. The mock interviews gruelled me a lot before the actual interview and hence I went to interview knowing what to expect. Today I am successfully placed a a software developer at Bluewud"
    },
    {
    
        "name":"Prakhar Agarwal",
        "image":"https://images.geekster.in/new-testimonial/Prakhar-Agarwal.webp",
        "company":"https://images.geekster.in/hiring-partners/PayPal.webp",
        "description":"What a wonderful journey I had at Geekster! To be honest they exceeded my expectations. I would have never imagined a 294% hike in the beginning of my career. But Geekster made it happen by taking my technical and softskills to another level. Can not thank my mentors and trainers enough."
    },
    {
        
        "name":"Pawan Kumar",
        "image":"https://images.geekster.in/new-testimonial/Pawan-Kumar.webp" ,
        "company":"https://images.geekster.in/hiring-partners/Radiansys.webp",
        "description":"Geekster educators were very good. We used to make live projects and with the help of educators and mentors I was able to transition from Petroleum engineering to software development engineering. I was not worried about the job because the teaching methodolody was so good. I knew I would get the job"}   
]